# SetTextureSet

## Description
Sets the texture set of an object.

```pascal
PROCEDURE SetTextureSet(
				obj        : HANDLE;
				textureSet : INTEGER);
```

```python
def vs.SetTextureSet(obj, textureSet):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object.|
|textureSet|INTEGER|The texture set. 0 - Object textures, 1 - Component textures|

## See Also
VS Functions:
GetTextureSet

## Version
Availability: from Vectorworks 2011

## Category
* Textures